# GetDataSchema Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPipeFittingAndAccessoryPressureDropServer..::..GetDataSchema Method
IPipeFittingAndAccessoryPressureDropServer Interface See Also
---
Obtains the schema of the ESEntity.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
Schema GetDataSchema()
```

Visual Basic
---
```text
Function GetDataSchema As Schema
```

Visual C++
---
```text
Schema^ GetDataSchema()
```

# ### Return Value
Null if the server has no data.
# See Also
IPipeFittingAndAccessoryPressureDropServer Interface
Autodesk.Revit.DB.Plumbing Namespace